In [1]:
import numpy as np
import pandas as pd

In [7]:
df_date=pd.read_csv("./datasets/orders.csv")
df_time=pd.read_csv("./datasets/time.csv")

In [9]:
df_date.head(5)

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

#### Date type column have different type of information is present. 
#### (i) Day
#### (ii) Month
#### (iii) Year
#### (iv) Day of Week
#### (v) Quarter of the year
#### (vi) Semester
#### (vii) Weekend or not

# Working with Date
#### Converting the string to date_type of dataframe column:  df['date'] = pd.to_datetime(df['date'])
#### Extracting the Year                     :  df["date_year"] =  df["date"].dt.year
#### Extracting the month                  : df["date_month"] = df["date"].dt.month
#### Extracting the day                       : df["date_day"] = df["date"].dt.day
#### Extracting month name              : df["date_month"] = df["date"].dt.month_name()
#### Extracting day of week               : df["date_day_of_week"] = df["date"].dt.dayofweek
#### Extracting the name of the day  : df["date_day_name"] = df["date"].dt.day_name()
#### Extracting the week of the year  : df["date_week_of_the_year"] = df["date"].dt.week
# Working with Time
#### Extracting the hour                       : df["hour"] = df["date"].dt.hour
#### Extracting the minute                   : df["hour"] = df["date"].dt.minute
#### Extracting the hour                       : df["hour"] = df["date"].dt.second

# Working with date

In [11]:
df_date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [12]:
df_date["date"]=pd.to_datetime(df_date["date"])

In [13]:
df_date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

In [35]:
df_date["year"]=df_date["date"].dt.year
df_date["month"]=df_date["date"].dt.month
df_date["day"]=df_date["date"].dt.day
df_date["month_name"]=df_date["date"].dt.month_name()
df_date["dayofweek"]=df_date["date"].dt.dayofweek
df_date["day_name"]=df_date["date"].dt.day_name()
df_date["week_of_year"]=df_date["date"].dt.week
df_date["isweekend"]=np.where(df_date["day_name"].isin(['Sunday','Saturday']),1,0)
df_date["quarter"] = df_date["date"].dt.quarter
df_date["semester"] = np.where(df_date["quarter"].isin([1,2]),1,2)

/tmp/ipykernel_10217/3790224294.py:7: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated. Please use Series.dt.isocalendar().week instead.
  df_date["week_of_year"]=df_date["date"].dt.week

In [36]:
df_date.drop(["city_id","product_id"],axis=1).sample(5)

,date,orders,year,month,day,month_name,dayofweek,day_name,week_of_year,isweekend,quarter,semester
845,2019-02-27,1,2019,2,27,February,2,Wednesday,9,0,1,1
256,2019-07-28,1,2019,7,28,July,6,Sunday,30,1,3,2
28,2019-04-20,1,2019,4,20,April,5,Saturday,16,1,2,1
230,2018-07-22,12,2018,7,22,July,6,Sunday,29,1,3,2
316,2019-01-24,2,2019,1,24,January,3,Thursday,4,0,1,1

# Extract the Elapse time

In [39]:
import datetime
today=datetime.datetime.today()
print(today-df_date["date"])

0     1113 days 15:08:10.933623
1     1595 days 15:08:10.933623
2     1526 days 15:08:10.933623
3     1228 days 15:08:10.933623
4     1451 days 15:08:10.933623
                 ...
995   1541 days 15:08:10.933623
996   1482 days 15:08:10.933623
997   1330 days 15:08:10.933623
998   1395 days 15:08:10.933623
999   1169 days 15:08:10.933623
Name: date, Length: 1000, dtype: timedelta64[ns]

### Extracting the only days

In [43]:
(today-df_date["date"]).dt.days

0      1113
1      1595
2      1526
3      1228
4      1451
       ...
995    1541
996    1482
997    1330
998    1395
999    1169
Name: date, Length: 1000, dtype: int64

### Extracting only month

In [47]:
np.round((today-df_date["date"])/np.timedelta64(1,'M'),0)

0      37.0
1      52.0
2      50.0
3      40.0
4      48.0
       ...
995    51.0
996    49.0
997    44.0
998    46.0
999    38.0
Name: date, Length: 1000, dtype: float64

### Extracting only year

In [48]:
np.round((today-df_date["date"])/np.timedelta64(1,'Y'),0)

0      3.0
1      4.0
2      4.0
3      3.0
4      4.0
      ...
995    4.0
996    4.0
997    4.0
998    4.0
999    3.0
Name: date, Length: 1000, dtype: float64

# Working with Time

In [51]:
df_time.sample(5)

                    date                                                msg
662  2012-02-14 14:20:00  мадератар привет паздравь с праздником ксюшу л...
925  2014-09-16 01:04:00  .М43.БИ.ПОЗНАМСЯ.С.СТРОЙН.Д/Ж.БИ.СЕМ/ПАР.БИ.ОБ...
816  2015-01-21 00:03:00   П поцелую Д в машине приеду перезваню 0679896878
947  2012-03-27 00:56:00  Да ну... 1000 нужно на 9 разделить... Это 111 ...
469  2014-07-09 01:20:00  ухахахахха..злобный смехх х ха хаа хааа ххааааааа

In [52]:
df_time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [53]:
df_time["date"]=pd.to_datetime(df_time["date"])

In [59]:
df_time["second"]=df_time["date"].dt.second
df_time["minute"]=df_time["date"].dt.minute
df_time["hour"]=df_time["date"].dt.hour
df_time["time"]=df_time["date"].dt.time

In [60]:
df_time.sample(5)

,date,msg,second,minute,hour,time
402,2014-03-12 00:54:00,Ищу простую добрую девушку для с/о Днепр мне 25,0,54,0,00:54:00
133,2012-01-05 23:47:00,П 28 ПОЗН. С ДЕВУШКОЙ ДЛЯ СЕРЬЕЗНЫХ ОТНОШЕНИЙ ...,0,47,23,23:47:00
871,2013-09-01 01:50:00,Крас П30л-ИЩУ КРАС ДЕВ_С/О-068 005 666 7,0,50,1,01:50:00
355,2013-06-01 01:39:00,ПАРА ИЩЕТ ДРУЗЕЙ ПРИЕЗЖАЙТЕ В ГОСТИ0679657159,0,39,1,01:39:00
345,2014-06-15 00:40:00,леночка звони на номер 0988129067,0,40,0,00:40:00

### Extracting total second

In [61]:
np.round((today-df_date["date"])/np.timedelta64(1,'s'),0)

0       96217691.0
1      137862491.0
2      131900891.0
3      106153691.0
4      125420891.0
          ...
995    133196891.0
996    128099291.0
997    114966491.0
998    120582491.0
999    101056091.0
Name: date, Length: 1000, dtype: float64

### Extracting total minute

In [62]:
np.round((today-df_date["date"])/np.timedelta64(1,'m'),0)

0      1603628.0
1      2297708.0
2      2198348.0
3      1769228.0
4      2090348.0
         ...
995    2219948.0
996    2134988.0
997    1916108.0
998    2009708.0
999    1684268.0
Name: date, Length: 1000, dtype: float64

### Extracting total hour

In [63]:
np.round((today-df_date["date"])/np.timedelta64(1,'h'),0)

0      26727.0
1      38295.0
2      36639.0
3      29487.0
4      34839.0
        ...
995    36999.0
996    35583.0
997    31935.0
998    33495.0
999    28071.0
Name: date, Length: 1000, dtype: float64